landing_user_Scenario mk-JMeter.yaml

# Script generated by Blazemeter Chrome Extension

execution:
  - scenario: landing_user_Event mk
    concurrency: 20
    ramp-up: 1m
    hold-for: 19m
scenarios:
  landing_user_Event mk:
    headers:
      sec-ch-ua: '"Chromium";v="128", "Not;A=Brand";v="24", "Google Chrome";v="128"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/128.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://nextv3.thinktalent.info/landing-user/user/task-list'
            method: GET
            label: 'https://nextv3.thinktalent.info/landing-user/user/task-list'
            think-time: 0ms
            headers: {}
          - url: >-
              https://nextv3.thinktalent.info/vdc-user/user/batch-wizard/20179785087536C4E0C6690120AB1D17
            method: GET
            label: >-
              https://nextv3.thinktalent.info/vdc-user/user/batch-wizard/20179785087536C4E0C6690120AB1D17
            think-time: 7048ms
            headers: {}
          - url: >-
              https://nextv3.thinktalent.info/scenario-user/user/instruction/89CC729088FDAFBA50720CF3EDD1182E
            method: GET
            label: >-
              https://nextv3.thinktalent.info/scenario-user/user/instruction/89CC729088FDAFBA50720CF3EDD1182E
            think-time: 2311ms
            headers: {}
            body:
              redirectJsonData: >-
                eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWRpcmVjdFVybCI6Imh0dHBzOi8vbmV4dHYzLnRoaW5rdGFsZW50LmluZm8vbGFuZGluZy11c2VyL3VzZXIvdGFzay1saXN0IiwiaXRlbU5hbWUiOiJUYXNrIiwiaW50ZWdyYXRpb25OYW1lIjoiVEFTSyJ9.61yhTSIy32xdP0wLSzBMkN9yaCzbPvxxUDiQjKGAn-c
          - url: 'https://www.youtube.com/embed/pzj73XZk5FE'
            method: GET
            label: 'https://www.youtube.com/embed/pzj73XZk5FE'
            headers: {}
            body:
              autoplay: '0'
              mute: '0'
              controls: '1'
              origin: 'https://nextv3.thinktalent.info'
              playsinline: '1'
              showinfo: '0'
              rel: '0'
              iv_load_policy: '3'
              modestbranding: '1'
              enablejsapi: '1'
              widgetid: '1'
          - url: 'https://pdf-viewer.thinktalent.info/web/viewer.html'
            method: GET
            label: 'https://pdf-viewer.thinktalent.info/web/viewer.html'
            headers: {}
            body:
              file: >-
                https://nextv3.thinktalent.info/scenario-user-service/rest/templatecasematerial/pdf/810B32D096ABC7B9CC6209EB49D7E7F5
          - url: 'https://nextv3.thinktalent.info/landing-user/user/task-list'
            method: GET
            label: 'https://nextv3.thinktalent.info/landing-user/user/task-list'
            think-time: 202957ms
            headers: {}